title: Suspicious PowerShell Encoded Command
id: suspicious_powershell_encoded
status: experimental
description: Detects PowerShell execution with encoded command patterns.
author: Detectra SOC
date: 2026-02-12
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
    process.name|endswith: powershell.exe
  selection_cmd:
    process.command_line|contains:
      - " -enc "
      - " -EncodedCommand "
      - "FromBase64String"
  condition: selection_img and selection_cmd
falsepositives:
  - Legitimate automation scripts
level: high
tags:
  - attack.execution
  - attack.t1059.001
